use honest_people

insert into Client
values
--ФИО, Фамилия, Имя, Отчество, Город, Улица, Дом, Корпус, Строение, Номер лицензии, Банковские реквизиты, ИНН, Нарк, Псих, Мед, Авт, Кошелёк, ТФ, почта

('Сайнароев Адам Исаевич','Сайнароев','Адам','Исаевич','Москва','Крёстного отца','13','6',null,null,'40866634','440301044015','1','1','1','1','101','79770666666','adams.06@bk.ru'),
('Астахов С. А.','Астахов','Сергей','Александрович','Санкт-Петербург','пл. Восстания','21',null,'2',null,'40703609','245906554093','1','0','1','0',null,'79063426357','s.a.astahov@gmail.com'),
('Сбербанк','','','','Москва','Вавилова','19',null,null,'1027700132195','40701765','7707083893','1','1','1','1',null,'78005555550','sberbank@sberbank.ru'),
('Бычихин Николай Павлович','Бычихин','Николай','Павлович','Балашиха','Строителей','1',null,null,null,'40812876',null,'0','0','1','1','104','79627390016',null),
('Перфилов Юрий Павлович','Перфилов','Юрий','Павлович','Красноярск','Космонавтов','20',null,null,null,'40898602',null,'1','0','1','0','105','79265437809',null),

('Честные люди','','','','Москва','Кропоткинский переулок','4',null,null,'1027700132195','40701583','9704000476','1','1','1','1',null,'79000000001',null),
('Яндекс.Такси','Аникин','Александр','Михайлович','Москва','1-й Красногвардейский пр-д','21',null,'1','5157746192731','40701984','7704340310','1','1','1','1',null,'74959999999','support@taxi.yandex.ru'),
('Алфёров Ю. Н.','Алфёров','Юрий','Николаевич','Краснодар','Тёмных фонарей','34','6','6',null,'40712567','262313552053','0','0','0','0',null,'79006661334','666@dark.ru'),
('Черкас Олег Владимирович','Черкас','Олег','Владимирович','Москва','Электрозаводская','32','4','1',null,'40877459',null,'1','1','0','1','109','79867654331',null),
('Лапкин Анатолий Александрович','Лапкин','Анатолий','Александрович','Пенза','Парковая','16',null,null,null,'40805680',null,'0','0','1','1',null,'79005467841','lapkinaa@yandex.ru'),

('Заваркин Алексей Петрович','Заваркин','Алексей','Петрович','Волгоград','Речная','23',null,null,null,'40823900',null,'1','0','1','0',null,'79835674209',null),
('Панков А. Н.','Панков','Андрей','Николаевич','Орёл','Октябрьская','13',null,null,null,'407034580','575200064760','0','1','1','0','112','79657768830','anpank@rambler.ru'),
('Новые Технологии','','','','Москва','2-Я Мытищинская','2',null,'8','1107746011911','40701876','7718791591','1','1','1','1',null,'79645789904','info@newtech.ru'),
('Флатов Е. Н.','Флатов','Евгений','Николаевич','Санкт-Петербург','Швецова','17',null,null,null,'40709735','110804934602','1','0','0','1',null,'79030508642',null),
('Губанов Вадим Артурович','Губанов','Вадим','Артурович','Орёл','Денисова','14',null,null,null,'40871094',null,'1','1','0','1',null,'79034775655','gubanovva@mail.ru'),

('Павлов Сергей Анатольевич','Павлов','Сергей','Анатольевич','Одинцово','Центральная','30','2',null,null,'40800400',null,'0','1','1','1',null,'79445678787','sapav@mail.ru'),
('Тыквин Андрей Васильевич','Тыквин','Андрей','Васильевич','Реутов','Ленина','11',null,'2',null,'40899987',null,'1','1','1','1',null,'79987765544','avtykvin@yandex.ru'),
('Злобин Евгений Русланович','Злобин','Евгений','Русланович','Реутов','Октябрьская','45','2',null,null,'40822890',null,'1','1','0','1',null,'79887658983','zlobin@inbox.ru')


insert into Individual
values
(1,'5413322588','Сайнароев','Адам','Исаевич','Москва','Крёстного отца','13','6',null,'79770666666','adams.06@bk.ru'),
(4,'3456734456','Бычихин','Николай','Павлович','Балашиха','Строителей','1',null,null,'79627390016',null),
(9,'4709456732','Черкас','Олег','Владимирович','Москва','Электрозаводская','32','4','1','79867654331',null),
(11,'2134988900','Заваркин','Алексей','Петрович','Волгоград','Речная','23',null,null,'79835674209',null)


insert into Entity
values
(3,'ПАО','Сбербанк','7707083893','773601001','1027700132195','Москва','Вавилова','19',null,null,'78005555550','sberbank@sberbank.ru'),
(7,'ООО','Яндекс.Такси','7704340310','770301001','5157746192731','Москва','1-й Красногвардейский пр-д','21',null,'1','74959999999',null),
(6,'ООО','Честные люди','9704000476','770401001','1197746540848','Москва','Кропоткинский переулок','4',null,null,'79000000001','support@taxi.yandex.ru'),
(13,'ООО','Новые Технологии','7718791591','771701001','1107746011911','Москва','2-Я Мытищинская','2',null,'8','79645789904','info@newtech.ru')

insert into Agent
values
(5,'9876543210','Перфилов','Юрий','Павлович','Красноярск','Космонавтов','20',null,null,'79265437809',null),
(10,'5890763452','Лапкин','Анатолий','Александрович','Пенза','Парковая','16',null,null,'79005467841','lapkinaa@yandex.ru'),
(15,'2258900544','Губанов','Вадим','Артурович','Орёл','Денисова','14',null,null,'79034775655','gubanovva@mail.ru'),
(16,'2455789000','Павлов','Сергей','Анатольевич','Одинцово','Центральная','30','2',null,'79445678787','sapav@mail.ru'),
(17,'3345666578','Тыквин','Андрей','Васильевич','Реутов','Ленина','11',null,'2','79987765544','avtykvin@yandex.ru'),
(18,'1223334567','Злобин','Евгений','Русланович','Реутов','Октябрьская','45','2',null,'79887658983','zlobin@inbox.ru')

insert into IE
values
(2,'Астахов С. А.','245906554093','79063426357','s.a.astahov@gmail.com'),
(8,'Алфёров Ю. Н.','262313552053','79265437809','666@dark.ru'),
(12,'Панков А.Н.','575200064760','79657768830','anpank@rambler.ru'),
(14,'Флатов Е. Н.','110804934602','79030508642',null)

insert into Cash
values
('RUB','Рубль'),
('DOL','Доллар'),
('BIT','Биткоин'),
('ETH','Эфириум')

insert into Uslugi
values
('Регистрация организации','10000','Поставка организации на учёт, внесение данных в гос.реестр',null,'1','1','0','0','1','0','0',1),
('Ликвидация организации','750','Снятие организации с учёта, обновление данных в гос.реестре','Нельзя ликвидировать незарегистрированную организацию','1','0','0','1','1','0','0',2),
('Объявление банкротом','250000','Объявление банкротом','Нельзя обанкротить незарегистрированную организацию','1','0','0','1','1','0','0',1),

('Лицензия на владение оружением','50','Выдача лицензии','18+','1','0','1','1','1','0','1',3),
('Выдача паспорта','15','Выдача паспорта, внесение прописки','14+, 2 фотографии','0','0','0','0','0','0','1',4),
('Выдача ВУ','25','Выдача ВУ, внесение данных в реестр ГАИ, обучение вождению, экзамен','18+','1','0','1','1','1','1','1',3)
--('Регистрация организации','10000','Поставка организации на учёт, внесение данных в гос.реестр',null,'1','0','0','1','0','0',1),

insert into Zakaz_Naryad
values
--Код Клиента, Код Посредника, Код Услуги, Дата обращения, Время обращения, Статус ЗН
(1,null,4,'2021-11-28',0),
(2,null,3,'2021-07-14',1),
(3,null,2,'2021-02-25',1),
(4,null,5,'2021-11-11',0),
(5,null,6,'2021-12-03',0),
(6,null,2,'2021-11-28',0),
(7,null,3,'2021-11-23',0),
(8,5,1,'2021-10-31',0),
(9,null,4,'2021-06-14',1),
(10,null,6,'2021-09-03',1),
(11,10,1,'2021-10-11',0),
(12,null,2,'2021-10-11',0),
(13,null,3,'2021-10-11',0),
(14,5,1,'2021-10-17',0),

(1,16,1,'2021-12-16',0),
(2,16,1,'2021-09-20',0),
(7,15,1,'2021-12-02',0),
(5,17,1,'2021-12-19',0),
(10,18,1,'2021-10-05',0),
(13,16,1,'2021-11-11',0)


insert into Bank
values
--Название, Город, Улица, Дом, Корпус, Строение, Корр. счёт, БИК, ИНН, КПП
('Сбербанк','Москва','Вавилова','19',null,null,'30101810400000000225','044525225','7707083893','773601001'),
('Тинькофф','Москва','Хуторская 2-я','38',null,'26','30101810145250000974','044525974','7710140679','771301001'),
('Райффайзенбанк','Москва','Троицкая','17',null,'1','30101810200000000700','044525700','7744000302','770201001'),
('Альфа-Банк','Москва','Каланчевская','27',null,null,'30101810200000000593','044525593','7728168971','770801001')
--('Бинанс','Москва','Электрический пер.','3/10',null,'1','','','9703021995','770301001')


insert into	Contracts
values
--Номер ЗН, Код Клиента, Код Посредника, Код Услуги, Стоимость, Код Валюты, Код Банка, Дата оформления
(1,1,null,4,'50',3,null,'2021-11-30'),
(2,2,null,3,'25000',1,1,'2021-07-15'),
(3,3,null,2,'750',1,3,'2021-02-28'),
(4,4,null,5,'14',4,null,'2021-12-12'),
(5,5,null,6,'18',3,null,'2021-12-03'),
(6,6,null,2,'800',1,4,'2021-11-29'),
(7,7,null,3,'25000',1,1,'2021-12-23'),
(8,8,5,1,'10000',1,2,'2021-11-01'),
(9,9,null,4,'80',3,null,'2021-06-14'),
(10,10,null,6,'17',3,null,'2021-09-03'),
(11,11,10,1,'9000',1,1,'2021-10-11'),
(12,12,null,2,'850',1,4,'2021-10-11'),
(13,13,null,3,'11000',1,2,'2021-10-11'),
(14,14,5,1,'13000',1,3,'2021-10-17'),
(15,1,16,1,'9000',1,3,'2021-12-19'),
(16,2,16,1,'12000',1,1,'2021-09-26'),
(17,7,15,1,'10000',1,2,'2021-12-07'),
(18,5,17,1,'15000',1,4,'2021-12-27'),
(19,10,18,1,'7000',1,3,'2021-10-13'),
(20,13,16,1,'14000',1,1,'2021-11-18')


insert into Invoice
values
--Код Клиента, Код Валюты, Код Банка, Категория Счёта, Крипта?, Номер кошелька, Комментарий
(1,3,null,1,1,'101',null),
(2,1,1,1,0,null,null),
(3,2,2,1,0,null,null),
(4,4,null,1,1,'104',null),
(5,3,null,1,1,'105',null),
(6,2,3,1,0,null,null),
(7,1,4,1,0,null,null),
(8,1,1,1,0,null,null),
(9,3,null,1,1,'109',null),
(10,1,1,0,0,null,null),
(11,2,2,1,0,null,null),
(12,2,null,1,1,'112',null),
(13,1,2,1,0,null,null),
(14,1,4,0,0,null,null)


insert into payment_Doc
values
--Номер Договора, Код Валюты, Код Банка, Сумма Документа, Связанный Документ, Дата Оплаты
(1,3,null,'10',null,'2021-11-21'),
(1,3,null,'50',null,'2021-11-03'),
(2,2,1,'100',null,'2021-10-30'),
(2,2,1,'200',null,'2021-10-31'),
(3,1,3,'3000',null,'2021-03-30'),
(3,1,3,'1000',null,'2021-04-02'),
(4,4,null,'14',null,'2021-12-15'),
(5,3,null,'8',null,'2021-12-05'),
(5,3,null,'10',null,'2021-12-20'),
(9,3,null,'30',null,'2021-07-10'),
(9,3,null,'20',null,'2021-07-13'),
(9,3,null,'30',null,'2021-07-17'),
(10,3,null,'5',null,'2021-09-05'),
(10,3,null,'12',null,'2021-09-05'),
(11,1,1,'3000',null,'2021-10-15'),
(11,1,1,'3000',null,'2021-10-25'),
(11,1,1,'3000',null,'2021-10-25'),
(12,2,4,'300',null,'2021-10-15'),
(12,2,4,'300',null,'2021-10-18'),
(12,2,4,'200',null,'2021-10-23'),
(13,1,2,'3000',null,'2021-10-15'),
(13,1,2,'5000',null,'2021-10-10'),
(13,1,2,'3000',null,'2021-10-25'),
(14,1,3,'3000',null,'2021-10-20'),
(14,1,3,'4000',null,'2021-10-26'),
(14,1,3,'6000',null,'2021-10-31')


insert into rate
values
(2,1,'','75.56'),
(3,1,'','4125212.33'),
(4,1,'','308619.51')
--(2,1,null,'30')

/*
insert into Zakaz_Naryad
values
--Код Клиента, Код Посредника, Код Услуги, Дата обращения, Время обращения, Статус ЗН
(1,10,4,'2021-11-28','20:38',0),
(2,5,3,'2021-07-14','15:54',1),
(3,15,2,'2021-02-25','13:22',1),
(4,16,5,'2021-11-11','11:11',0),
(5,17,6,'2021-12-03','14:48',0),
(6,18,2,'2021-11-28','20:42',0),
(7,15,3,'2021-11-23','10:34',0),
(8,5,1,'2021-10-31','16:23',0),
(9,16,4,'2021-06-14','14:33',1),
(10,17,6,'2021-09-03','12:00',1),
(11,10,1,'2021-10-11','15:32',0),
(12,18,2,'2021-10-11','17:17',0),
(13,16,3,'2021-10-11','19:57',0),
(14,5,1,'2021-10-17','10:37',0)
*/

/*
insert into	Contracts
values
--Номер ЗН, Код Клиента, Код Посредника, Код Услуги, Стоимость, Код Валюты, Код Банка, Дата оформления
(1,1,10,4,'5000',3,null,'2021-11-30'),
(2,2,5,3,'25000',1,1,'2021-07-15'),
(3,3,15,2,'7500',1,3,'2021-02-28'),
(4,4,16,5,'1400',4,null,'2021-12-12'),
(5,5,17,6,'18000',3,null,'2021-12-03'),
(6,6,18,2,'7500',1,4,'2021-11-29'),
(7,7,15,3,'25000',1,1,'2021-12-23'),
(8,8,5,1,'10000',1,2,'2021-11-01'),
(9,9,16,4,'8000',3,null,'2021-06-14'),
(10,10,17,6,'17000',3,null,'2021-09-03'),
(11,11,10,1,'9000',1,1,'2021-10-11'),
(12,12,18,2,'8000',1,4,'2021-10-11'),
(13,13,16,3,'11000',1,2,'2021-10-11'),
(14,14,5,1,'13000',1,3,'2021-10-17')
*/

/*
insert into Zakaz_Naryad
values
--Код Клиента, Код Посредника, Код Услуги, Дата обращения, Время обращения, Статус ЗН
(1,null,4,'2021-11-28','20:38',0),
(2,null,3,'2021-07-14','15:54',1),
(3,null,2,'2021-02-25','13:22',1),
(4,null,5,'2021-11-11','11:11',0),
(5,null,6,'2021-12-03','14:48',0),
(6,null,2,'2021-11-28','20:42',0),
(7,null,3,'2021-11-23','10:34',0),
(8,5,1,'2021-10-31','16:23',0),
(9,null,4,'2021-06-14','14:33',1),
(10,null,6,'2021-09-03','12:00',1),
(11,10,1,'2021-10-11','15:32',0),
(12,null,2,'2021-10-11','17:17',0),
(13,null,3,'2021-10-11','19:57',0),
(14,5,1,'2021-10-17','10:37',0),

(1,16,1,'2021-12-16','14:56',0),
(2,16,1,'2021-09-20','12:12',0),
(7,15,1,'2021-12-02','17:03',0),
(5,17,1,'2021-12-19','16:20',0),
(10,18,1,'2021-10-05','09:30',0),
(13,16,1,'2021-11-11','11:11',0)
*/